function changeColor(Element) {
    if (Element.style.backgroundColor == "greenyellow" || Element.style.backgroundColor == "") {
        Element.style.backgroundColor = "red";
    }
    else {
        Element.style.backgroundColor = "greenyellow";
    }
}

function on(x) {
    document.getElementById("overlay").style.display = "block";
    // var Image_Id = document.getElementById('questionimage');
    // Image_Id.src = "Resources/"+x+".png";
    //document.getElementById('quesflex').style.backgroundImage.src = "Resources/qbg.png";
    document.getElementById("questiontext").innerHTML = questions[x];
}

function off() {
    document.getElementById("overlay").style.display = "none";
}

function startTimer(){
    document.getElementById("timer").play();
}

function stopTimer(){
    document.getElementById("timer").load();
}

function demo() {
    document.getElementById("overlay").style.display = "block";
    var Image_Id = document.getElementById('demoimage');
    Image_Id.src = "Resources/Qdemo.png";
}


// Questions Array

let questions = new Array(100);

questions[11] = "'मैला आँचल' की रचना किसने की थी? <br><br>(A) धर्मवीर भारती <br>(B) प्रेमचंद <br>(C) फणीश्वरनाथ रेणु <br>(D) महादेवी वर्मा";
questions[12] = "'राग दरबारी' की रचना किसने की थी? <br><br>(A) हरिवंशराय बच्चन <br>(B) श्रीलाल शुक्ल <br>(C) प्रेमचंद <br>(D) यतीन्द्र मिश्र";
questions[13] = "'गुनाहों की देवता' की रचना किसने की थी? <br><br>(A) सूर्यकान्त त्रिपाठी 'निराला' <br>(B) धर्मवीर भारती  <br>(C) जयशंकर प्रसाद <br>(D) रामधारी सिंह दिनकर";
questions[14] = "'तितली' उपन्यास के लेखक कौन है ? <br><br>(A) अज्ञेय <br>(B) जयशंकर प्रसाद <br>(C) प्रेमचंद <br>(D) मोहन राकेश";
questions[15] = "कलम का सिपाही किसे कहा जाता है? <br><br>(A) प्रेमचंद <br>(B) हरिवंशराय बच्चन <br>(C) रामधारी सिंह दिनकर <br>(D) महादेवी वर्मा";
questions[16] = "भारत के प्रथम राष्ट्रकवि कौन हैं? <br><br>(A) रामधारी सिंह 'दिनकर' <br>(B) मैथिलीशरण गुप्त <br>(C) महादेवी वर्मा <br>(D) प्रेमचंद";
questions[17] = "देश का पहला राष्ट्रीय हिन्दी संग्रहालय कहाँ स्थापित किया जा रहा है? <br><br>(A) आगरा <br>(B) लखनऊ <br>(C) गाजियाबाद  <br>(D) वाराणसी";

questions[21] = "नहीं चाहिये इंजन मुझको, नहीं चाहिये खाना, <br>मुझ पर चढ़कर आसपास का, कर लो सफर सुहाना";
questions[22] = "कभी बड़ा हो कभी हो छोटा, माह में एक दिन मारे गोता";
questions[23] = "बेशक न हो हाथ में हाथ, जीता है वह आपके साथ";
questions[24] = "नया खजाना घर में आया, <br>डब्बे में संसार समाया। <br>नया करिश्मा बेजोडी का, <br>नाम बताओ इस योगी का";
questions[25] = "इंसान की ऐसी चीज जो उसकी है पर इस्तेमाल पूरी दुनिया करती है, बूझो तो जाने!";
questions[26] = "वो कौन है जो बिना पर के उड़ता है और बिना हाथ के लड़ता है?";
questions[27] = "खाना दोगे तो जिन्दा रहूँगा पानी दोगे तो मर जाऊंगा, बताओ मेरा नाम?";

questions[31] = "बाड़ ही जब खेत को खाए तो रखवाली कौन करे <br><br>उपरोक्त मुहावरे/लोकोक्ति का अर्थ क्या होता है?";
questions[32] = "बाप न मारे मेढकी, बेटा तीरंदाज़ <br><br>उपरोक्त मुहावरे/लोकोक्ति का अर्थ क्या होता है?";
questions[33] = "बारह गाँव का चौधरी अस्सी गाँव का राव, <br>अपने काम न आवे तो ऐसी-तैसी में जाव। <br><br>उपरोक्त मुहावरे/लोकोक्ति का अर्थ क्या होता है?";
questions[34] = "बिंध गया सो मोती, रह गया सो सीप <br><br>उपरोक्त मुहावरे/लोकोक्ति का अर्थ क्या होता है?";
questions[35] = "अभी दिल्ली दूर है <br><br>उपरोक्त मुहावरे/लोकोक्ति का अर्थ क्या होता है?";
questions[36] = "आंसू एक नहीं और कलेजा टूक-टूक <br><br>उपरोक्त मुहावरे/लोकोक्ति का अर्थ क्या होता है?";
questions[37] = "आया है जो जायेगा, राजा रंक फकीर <br><br>उपरोक्त मुहावरे/लोकोक्ति का अर्थ क्या होता है?";

questions[41] = "समास कितने प्रकार के होते हैं? <br><br>(A) 2 <br>(B) 4 <br>(C) 6 <br>(D) 8";
questions[42] = "नवयुवक कौन-सा समास है? <br><br>(A) कर्मधारय <br>(B) बहुव्रीहि <br>(C) द्वंद्व <br>(D) द्विगु";
questions[43] = "नीलकंठ कौन-सा समास है?  <br><br>(A) कर्मधारय <br>(B) बहुव्रीहि <br>(C) अव्ययीभाव <br>(D) तत्पुरुष";
questions[44] = "'महाशय' शब्द का स्त्रीलिंग रूप क्या है ? <br><br>(A) महाशिनी <br>(B) महाशयी <br>(C) महाशया <br>(D) महाशियी";
questions[45] = "महेन्द्र का सन्धि विच्छेद क्या है? <br><br>(A) महो+इन्द्र <br>(B) महे+इन्द्र <br>(C) महा+इन्द्र";
questions[46] = "'पर्यावरण' का सही संधि-विच्छेद है? <br><br>(A) पर्या + वरण <br>(B) परिधि + आवरण <br>(C) परिध + आवरण <br>(D) परि + आवरण";
questions[47] = "इनमें से हवा का पर्यायवाची कौन है? <br><br>(A) धीर <br>(B) तनुज <br>(C) बयार <br>(D) नाराच";

questions[51] = "'पुस्तक' कौन-सा शब्द है? <br><br>(A) तद्भव<br>(B) तत्सम<br>(C) देशज<br>(D) विदेशज";
questions[52] = "निम्नलिखित में अशुद्ध शब्द है?<br><br>(A) एकत्र<br>(B) नीरस <br>(C) मंत्रीमंडल <br>(D) योगिराज";
questions[53] = "'त्र' वर्ण किसके योग से बना है?<br><br>(A) ज् +ञ +अ <br>(B) त् +र् +अ <br>(C) श् + र् +अ <br>(D) क् + ष+ अ";
questions[54] = "'सुरभित' का अर्थ है?<br><br>(A) सुगंधित <br>(B) पुष्प <br>(C) कलहंस <br>(D) भाग्यवान";
questions[55] = "'मकरंद' का अर्थ है? <br><br>(A) फूलों का रस <br>(B) पुष्प <br>(C) अपरस <br>(D) सुवासित";
questions[56] = "मितव्ययी का अर्थ है?<br><br>(A) कम खर्च करनेवाला <br>(B) व्युत्पत्ति <br>(C) तनुज <br>(D) प्रेरणादायक";
questions[57] = "'भंवरा' में उचित स्थान पर अनुनासिक लगाकर मानक रूप क्या होगा? <br><br>(A) भँवरा <br>(B) भंवरा <br>(C) भवराँ<br>(D) भवँरा";

questions[61] = "मुगल काल में हिंदी भाषा पर प्रभाव डालनेवाली भाषा कौन सी है?<br><br>(A) फारसी<br>(B) अंग्रेजी<br>(C) हिंदी<br>(D) उर्दू";
questions[62] = "निम्न मे से दन्तय ध्वनि कौन सी है? <br><br>(A) प, फ<br>(B) क, ख<br>(C) त, थ<br>(D) च, छ";
questions[63] = "भारतवर्ष में हिन्दी को आप किस वर्ग में रखेंगे? <br><br>(A) राजभाषा <br>(B) राष्ट्रभाषा<br>(C) विभाषा<br>(D) तकनीकी भाषा";
questions[64] = "हिंदी की पहली फिल्म कौन सी है?<br><br>(A) राजा हरिशचंद्र<br>(B) आलमआरा<br>(C) प्यासा<br>(D) मुगल-ए-आजम";
questions[65] = "गूगल ने अपने सर्च इंजिन में हिंदी में खोज की सुविधा कब शुरू की? <br><br>(A) 2010<br>(B) 2011<br>(C) 2014<br>(D) 2009";
questions[66] = "हिंदी में लिखी गई संविधान की मूल प्रति पर संविधान सभा ने कब हस्ताक्षर किए? <br><br>(A) 29 जनवरी 1950<br>(B) 2 जनवरी 1950<br>(C) 24 जनवरी 1950<br>(D) 17 अगस्त 1949";
questions[67] = "देवनागरी लिपि में हिंदी के अतिरिक्त और कौन सी भाषा लिखी जाती है?<br><br>(A) तमिल <br>(B) बाँग्ला <br>(C) पंजाबी <br>(D) मराठी";

questions[38] = "इनमें से अलंकार के कौन सा भेद है?<br><br>(A) शब्दालंकार<br>(B) छेकानुप्रास<br>(C) लाटानुप्रास<br>(D) इनमें से कोई नहीं";
questions[48] = "संधि कितने प्रकार के होते है?<br><br>(A) 1<br>(B) 2<br>(C) 3<br>(D) 4";